k0_0400/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet
    {
        //type            fixedValue;
        //value           uniform (1.0 0 0);
        type              pressureNormalInletOutletVelocity;
        //phi               phi;
        //rho               rho;
        value             uniform (0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            noSlip;
    }

    top
    {
        type            symmetryPlane;
    }
    
    back
    {
        type            empty;
    }
    
    front
    {
        type            empty;
    }
    
    plate
    {
        type            movingWallVelocity;
        value           $internalField;
    }
    
    back1
    {
        type            empty;
    }
    
    front1
    {
        type            empty;
    }
    
    overset
    {
        type            overset;
    }
    
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
