k0_0400/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1.0;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetryPlane;
    }

    back
    {
        type            empty;
    }
    
    front
    {
        type            empty;
    }

    plate
    {
        type            zeroGradient;
    }
    
    back1
    {
        type            empty;
    }
    
    front1
    {
        type            empty;
    }
    
    overset
    {
        type            overset;
    }
   
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
